app/views/users/show.html.erb

SELECT "neopets".* FROM "neopets" WHERE "neopets"."user_id" = ?  [["user_id", 1]]
---
<br>
<% @user.neopets.each do |n| %>