app/controllers/neopets_controller.rb

SELECT "neopets".* FROM "neopets"
---
  def index
    @neopets = Neopet.all

SELECT  "neopets".* FROM "neopets" WHERE "neopets"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @neopet = Neopet.find(params[:pet_id])

SELECT  "neopets".* FROM "neopets" WHERE "neopets"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @neopet = Neopet.find(params[:pet_id])

UPDATE "neopets" SET "happiness" = ?, "updated_at" = ? WHERE "neopets"."id" = ?  [["happiness", 250], ["updated_at", "2019-01-14 21:07:14.085580"], ["id", 1]]
---
  def play_song
    play_music
    happy = @neopet.happiness + 50
    @neopet.update(happiness: happy)

SELECT  "neopets".* FROM "neopets" WHERE "neopets"."id" = ? LIMIT 1  [["id", 1]]
---
    def find_neo_params
      @neopet = Neopet.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def find_user_params
      @user = User.find(params[:id])